---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.InvalidPathArgumentException
source: html/7d976e55-62e7-376a-7822-0a6846e2c17d.htm
---
# InvalidPathArgumentException Methods

Retrieves data needed to serialize the target object.